CSI API ETABS v1
eTemplateType Enumeration
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public enum eTemplateType
Public Enumeration eTemplateType
Dim instance As eTemplateType
public enum class eTemplateType
type eTemplateType
Members
Member name | Value | Description
Grid | 0
Clear | 1
Beam | 2
SlopedTruss | 3
VerticalTruss | 4
SpaceTruss | 5
PortalFrame | 6
BracedFrame | 7
EccentricFrame | 8
PerimeterFrame | 9
SpaceFrame | 10
Bridge | 11
Barrel | 12
Cylinder | 13
Dome | 14
ShearWall | 15
Floor | 16
Advanced | 17
UndergoundConcrete | 18
Truss2D | 19
Truss3D | 20
Frame2D | 21
Frame3D | 22
BridgeWizard | 23
PipesAndPlates | 24
Shells | 25
SolidModels | 26
StorageStructures | 27
Staircases | 28
CableBridges | 29
See Also
Reference
ETABSv1 Namespace